# Task5:-
=======
Given:-
--------
name  dept  
ravi  sales
manu  purch
hari  accts

Expected1:-
==========
name  sales  purch  accts
ravi  1      0      0
manu  0      1      0
hari  0      0      1

Expected2:-
===========
name  dept
ravi  1
manu  2
hari  3

Expected3:-
==========
name  dept
ravi  0.1
manu  0.2
hari  0.3

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("emp.csv",sep = " ")
df

   name  Unnamed: 1   dept
0  ravi         NaN  sales
1  manu         NaN  purch
2  hari         NaN  accts

In [3]:
df = df[['name','dept']]

In [4]:
df

   name   dept
0  ravi  sales
1  manu  purch
2  hari  accts

In [5]:
df.columns

Index(['name', 'dept'], dtype='object')

In [6]:
df.loc[0,'name']

'ravi'

In [7]:
res1 = pd.DataFrame(columns = ['name','sales','purch','accts'])
res1

Empty DataFrame
Columns: [name, sales, purch, accts]
Index: []

In [8]:
for i in range(len(df)):
    res1.loc[i,'name'] = df.loc[i,'name']
    res1.loc[i,df.loc[i,'dept']] = 1
res1.fillna(0,inplace = True)    
res1

   name  sales  purch  accts
0  ravi      1      0      0
1  manu      0      1      0
2  hari      0      0      1

In [9]:
ex_data1 = {'sales' : 1,'purch':2,'accts':3}

In [10]:
ex_data1['sales']

1

In [11]:
res2 = df.copy()
for i in range(len(df)):
    res2.loc[i,'dept'] = ex_data1[res2.loc[i,'dept']]
res2

   name dept
0  ravi    1
1  manu    2
2  hari    3

In [12]:
ex_data2 = {'sales' : 0.1,'purch':0.2,'accts':0.3}

In [13]:
res3 = df.copy()
for i in range(len(df)):
    res3.loc[i,'dept'] = ex_data2[res3.loc[i,'dept']]
res3

   name dept
0  ravi  0.1
1  manu  0.2
2  hari  0.3